[
  {
    "week": 1,
    "ranking": 1,
    "team": "Philadelphia Eagles",
    "blurb": "The Eagles are loaded, even without quarterback Carson Wentz as their opening week starter."
  },
  {
    "week": 1,
    "ranking": 2,
    "team": "New England Patriots",
    "blurb": "The window may be closing for the Patriots’ dynasty. But as long as Bill Belichick and Tom Brady are there, the Pats are legitimate Super Bowl contenders."
  },
  {
    "week": 1,
    "ranking": 3,
    "team": "Pittsburgh Steelers",
    "blurb": "The Steelers should again be one of the most dynamic offenses in the NFL … if running back Le’Veon Bell shows up prior to the season opener."
  },
  {
    "week": 1,
    "ranking": 4,
    "team": "Minnesota Vikings",
    "blurb": "The Vikings boast perhaps the league’s premier defense. Will Kirk Cousins be the last piece of the puzzle in Minnesota?"
  },
  {
    "week": 1,
    "ranking": 5,
    "team": "Jacksonville Jaguars",
    "blurb": "The Jaguars’ defense is dominant, but is Blake Bortles good enough to contribute to a Super Bowl run."
  },
  {
    "week": 1,
    "ranking": 6,
    "team": "Los Angeles Rams",
    "blurb": "The Rams owned the offseason, and now Aaron Donald is back as well. Look out below."
  },
  {
    "week": 1,
    "ranking": 7,
    "team": "New Orleans Saints",
    "blurb": "Without Mark Ingram, who is suspended for the first four games, it’ll be up to second-year standout Alvin Kamara to produce a dazzling sequel."
  },
  {
    "week": 1,
    "ranking": 8,
    "team": "Atlanta Falcons",
    "blurb": "The Super Bowl will be in Atlanta this season. Will the Falcons be there, too?"
  },
  {
    "week": 1,
    "ranking": 9,
    "team": "Green Bay Packers",
    "blurb": "Aaron Rodgers is healthy and happy, after earning one heck of a paycheck this offseason. As he goes, so go the Packers."
  },
  {
    "week": 1,
    "ranking": 10,
    "team": "Carolina Panthers",
    "blurb": "The Panthers know what they have in veteran quarterback Cam Newton. The question is whether their offensive line will keep him upright."
  },
  {
    "week": 1,
    "ranking": 11,
    "team": "Los Angeles Chargers",
    "blurb": "There is reason for optimism in Los Angeles, and not just because of the Rams and Lakers. Good luck finding a more established pass-rushing duo than Joey Bosa and Melvin Ingram III."
  },
  {
    "week": 1,
    "ranking": 12,
    "team": "Kansas City Chiefs",
    "blurb": "The Patrick Mahomes era has begun in Kansas City. Now, we’ll all find out if the second-year quarterback is ready."
  },
  {
    "week": 1,
    "ranking": 13,
    "team": "Houston Texans",
    "blurb": "Deshaun Watson and J.J. Watt are back, and the Texans may be primed for the playoffs."
  },
  {
    "week": 1,
    "ranking": 14,
    "team": "Chicago Bears",
    "blurb": "Has the addition of Khalil Mack pushed the Bears into the playoff picture?"
  },
  {
    "week": 1,
    "ranking": 15,
    "team": "New York Giants",
    "blurb": "Eli Manning may not have anything left in the tank. But considering Saquon Barkley’s arrival and Odell Beckham Jr.’s big deal, it might not matter, either."
  },
  {
    "week": 1,
    "ranking": 16,
    "team": "Dallas Cowboys",
    "blurb": "Ezekiel Elliott is the primary focus offensively, but for the first time in years, Dallas has considerable questions along its offensive line."
  },
  {
    "week": 1,
    "ranking": 17,
    "team": "Seattle Seahawks",
    "blurb": "No Richard Sherman. No Kam Chancellor. No Michael Bennett. No Earl Thomas (for now). No telling what these Seahawks will look like in 2018."
  },
  {
    "week": 1,
    "ranking": 18,
    "team": "San Francisco 49ers",
    "blurb": "The 49ers closed the 2017 season with five consecutive wins. But was that a mirage or a sign of things to come?"
  },
  {
    "week": 1,
    "ranking": 19,
    "team": "Denver Broncos",
    "blurb": "Quarterback Case Keenum will attempt to resurrect the Broncos after an unexpected 5-11 tumble in 2017."
  },
  {
    "week": 1,
    "ranking": 20,
    "team": "Detroit Lions",
    "blurb": "It's first-year head coach Matt Patricia's job to turn around a group that finished 27th in total defense last season. Good luck."
  },
  {
    "week": 1,
    "ranking": 21,
    "team": "Oakland Raiders",
    "blurb": "Jon Gruden is back! But Khalil Mack isn't. The Raiders could be gearing up for an eventual rebuild."
  },
  {
    "week": 1,
    "ranking": 22,
    "team": "Baltimore Ravens",
    "blurb": "The Ravens, who kicked off the preseason by beating the Bears in the Hall of Fame Game, are the only team in the NFL to enjoy a 5-0 preseason. We'll see if that matters on Sunday."
  },
  {
    "week": 1,
    "ranking": 23,
    "team": "Tennessee Titans",
    "blurb": "The Titans made the playoffs in 2017, won a playoff game and then fired their head coach. I'm still trying to make sense of that whole situation."
  },
  {
    "week": 1,
    "ranking": 24,
    "team": "Arizona Cardinals",
    "blurb": "The good news for Arizona is that running back David Johnson is back. The bad news is that Sam Bradford is the Cardinals' starting quarterback."
  },
  {
    "week": 1,
    "ranking": 25,
    "team": "Cincinnati Bengals",
    "blurb": "The Bengals finished 31st in rushing offense and 27th in passing offense last season. And if you can't run, and you can't pass ... you get the idea."
  },
  {
    "week": 1,
    "ranking": 26,
    "team": "Indianapolis Colts",
    "blurb": "Andrew Luck's return is a bright spot for Indianapolis. The rest of its roster is not."
  },
  {
    "week": 1,
    "ranking": 27,
    "team": "Cleveland Browns",
    "blurb": "The Browns are still the Browns. Moving on."
  },
  {
    "week": 1,
    "ranking": 28,
    "team": "Buffalo Bills",
    "blurb": "The Bills announced this week that they will start Nathan Peterman at quarterback for the season opener. This does not inspire confidence."
  },
  {
    "week": 1,
    "ranking": 29,
    "team": "Washington",
    "blurb": "The Washington offense, which lost running back Derrius Guice for the season, looked dreadful during the preseason. We'll see if Alex Smith and Adrian Peterson can change that. "
  },
  {
    "week": 1,
    "ranking": 30,
    "team": "Tampa Bay Buccaneers",
    "blurb": "Quarterback Jameis Winston will be suspended for the Buccaneers' first three games. Tampa Bay could be in for a long season."
  },
  {
    "week": 1,
    "ranking": 31,
    "team": "New York Jets",
    "blurb": "Sam Darnold will be the Jets' starting quarterback on Sunday. The good news is that his first three opponents are the Lions, the Dolphins and the Browns."
  },
  {
    "week": 1,
    "ranking": 32,
    "team": "Miami Dolphins",
    "blurb": "Well, at least the fans still live in Miami. That should provide some consolation in 2018. "
  },
  {
    "week": 2,
    "ranking": 1,
    "team": "Philadelphia Eagles",
    "blurb": "The Eagles used the \"Philly Special\" to pick up another win. Real original."
  },
  {
    "week": 2,
    "ranking": 2,
    "team": "New England Patriots",
    "blurb": "Tom Brady threw for 277 yards and three touchdowns last weekend, despite having a no-name wide receiver corps. In other words, it's business as usual."
  },
  {
    "week": 2,
    "ranking": 3,
    "team": "Minnesota Vikings",
    "blurb": "The punishing Minnesota defense forced four San Francisco turnovers in its season opener. That isn't a fluke."
  },
  {
    "week": 2,
    "ranking": 4,
    "team": "Los Angeles Rams",
    "blurb": "Todd Gurley and Jared Goff were both sharp in the Rams' season opener. When they're rolling like that, who can stop them?"
  },
  {
    "week": 2,
    "ranking": 5,
    "team": "Jacksonville Jaguars",
    "blurb": "acksonville's offense was underwhelming already. If Leonard Fournette has to miss any time with a hamstring injury, the Jaguars might be in trouble."
  },
  {
    "week": 2,
    "ranking": 6,
    "team": "Carolina Panthers",
    "blurb": "Carolina's defense held the Dallas Cowboys to just eight points, 232 total yards and 94 rushing yards last week. That's an impressive start."
  },
  {
    "week": 2,
    "ranking": 7,
    "team": "Kansas City Chiefs",
    "blurb": "The Patrick Mahomes era kicked off with four touchdown passes in an impressive 38-28 win over the Chargers. All aboard the hype train."
  },
  {
    "week": 2,
    "ranking": 8,
    "team": "Denver Broncos",
    "blurb": "The Broncos' pass rush is still fearsome, but Case Keenum needs to be better if the Broncos are going to make a serious run."
  },
  {
    "week": 2,
    "ranking": 9,
    "team": "Atlanta Falcons",
    "blurb": "The Falcons scored just 10 points in five red zone trips last week. Matt Ryan, Julio Jones and Co. have work to do."
  },
  {
    "week": 2,
    "ranking": 10,
    "team": "Baltimore Ravens",
    "blurb": "How impressive is a 47-3 win when it comes over the lowly Bills? We'll find out when the Ravens meet the Bengals on Thursday."
  },
  {
    "week": 2,
    "ranking": 11,
    "team": "Green Bay Packers",
    "blurb": "If Aaron Rodgers has to miss any time with a knee injury, the ship might sink in Green Bay."
  },
  {
    "week": 2,
    "ranking": 12,
    "team": "New York Giants",
    "blurb": "Saquon Barkley and Odell Beckham did their part in the Giants' season-opening loss to Jacksonville. Now Eli Manning needs to do his."
  },
  {
    "week": 2,
    "ranking": 13,
    "team": "Los Angeles Chargers",
    "blurb": "The Chargers didn't have Joey Bosa last weekend ... and it showed."
  },
  {
    "week": 2,
    "ranking": 14,
    "team": "Pittsburgh Steelers",
    "blurb": "Le'Veon, Le'Veon, wherefore art thou, Le'Veon?"
  },
  {
    "week": 2,
    "ranking": 15,
    "team": "Tampa Bay Buccaneers",
    "blurb": "Ryan Fitzpatrick threw for 417 yards and four touchdowns on the road against the Saints. You figure it out."
  },
  {
    "week": 2,
    "ranking": 16,
    "team": "Cleveland Browns",
    "blurb": "For the first time since Dec. 24, 2016, the Browns didn't lose. But they didn't win, either."
  },
  {
    "week": 2,
    "ranking": 17,
    "team": "Chicago Bears",
    "blurb": "The Bears led the Packers 20-0 late in the third quarter last weekend. They're 0-1. That's Aaron Rodgers."
  },
  {
    "week": 2,
    "ranking": 18,
    "team": "Cincinnati Bengals",
    "blurb": "Maybe the Bengals' offense really is improved. Or maybe we just think so because they picked on the hapless Colts."
  },
  {
    "week": 2,
    "ranking": 19,
    "team": "Houston Texans",
    "blurb": "Deshaun Watson's return from a torn ACL wasn't enough for the Texans to upright the Patriots in New England."
  },
  {
    "week": 2,
    "ranking": 20,
    "team": "Seattle Seahawks",
    "blurb": "Doug Baldwin is down and the Seahawks' pass rush is non-existent. Oh, and that offensive line has to protect Russell Wilson from Khalil Mack on Monday night."
  },
  {
    "week": 2,
    "ranking": 21,
    "team": "San Francisco 49ers",
    "blurb": "Jimmy Garoppolo completed just 45.5 percent of his passes and threw three interceptions against Minnesota. Not exactly how you make good on that massive offseason contract."
  },
  {
    "week": 2,
    "ranking": 22,
    "team": "New Orleans Saints",
    "blurb": "The Saints gave up 48 points and lost to the Bucs -- yes, the Bucs -- at home. Did anyone see that coming?"
  },
  {
    "week": 2,
    "ranking": 23,
    "team": "Dallas Cowboys",
    "blurb": "Dallas, which has made its name by running the football, managed just 94 rushing yards in a loss to the Panthers. The pressure's on Dak Prescott."
  },
  {
    "week": 2,
    "ranking": 24,
    "team": "New York Jets",
    "blurb": "After throwing a pick-six on his first NFL pass, Sam Darnold settled down and led the Jets to a road win. So far, so good."
  },
  {
    "week": 2,
    "ranking": 25,
    "team": "Oakland Raiders",
    "blurb": "Derek Carr's three interceptions helped spoil Jon Gruden's Black Hole homecoming in Oakland."
  },
  {
    "week": 2,
    "ranking": 26,
    "team": "Miami Dolphins",
    "blurb": "Miami's game last weekend lasted more than seven hours because of weather delays. But hey, a win's a win."
  },
  {
    "week": 2,
    "ranking": 27,
    "team": "Washington",
    "blurb": "Adrian Peterson provided a blast from the past in Washington's season opener, producing 166 total yards and a touchdown in the win over Arizona."
  },
  {
    "week": 2,
    "ranking": 28,
    "team": "Tennessee Titans",
    "blurb": "Marcus Mariota's status is unknown with an elbow injury. Good luck with Blaine Gabbert, Titans fans!"
  },
  {
    "week": 2,
    "ranking": 29,
    "team": "Indianapolis Colts",
    "blurb": "Andrew Luck is back! Unfortunately the can't be said for Edgerrin James and Reggie Wayne."
  },
  {
    "week": 2,
    "ranking": 30,
    "team": "Arizona Cardinals",
    "blurb": "The Cardinals produced just 213 total yards and six points in Sam Bradford's Arizona debut. Josh Rosen better start warming up."
  },
  {
    "week": 2,
    "ranking": 31,
    "team": "Detroit Lions",
    "blurb": "Matt Stafford threw four interceptions and the Lions were blown out at home by a rookie quarterback making his first career start. Not a great first impression for Matt Patricia."
  },
  {
    "week": 2,
    "ranking": 32,
    "team": "Buffalo Bills",
    "blurb": "After making the playoffs in 2017, the Bills lost 47-3 to the Baltimore Ravens last weekend. It's only a matter of time until Buffalo is on the clock."
  }
]