[
  {
    "week": 1,
    "ranking": 1,
    "team": "Philadelphia Eagles",
    "blurb": "The Eagles are loaded, even without quarterback Carson Wentz as their opening week starter."
  },
  {
    "week": 1,
    "ranking": 2,
    "team": "New England Patriots",
    "blurb": "The window may be closing for the Patriots’ dynasty. But as long as Bill Belichick and Tom Brady are there, the Pats are legitimate Super Bowl contenders."
  },
  {
    "week": 1,
    "ranking": 3,
    "team": "Pittsburgh Steelers",
    "blurb": "The Steelers should again be one of the most dynamic offenses in the NFL … if running back Le’Veon Bell shows up prior to the season opener."
  },
  {
    "week": 1,
    "ranking": 4,
    "team": "Minnesota Vikings",
    "blurb": "The Vikings boast perhaps the league’s premier defense. Will Kirk Cousins be the last piece of the puzzle in Minnesota?"
  },
  {
    "week": 1,
    "ranking": 5,
    "team": "Jacksonville Jaguars",
    "blurb": "The Jaguars’ defense is dominant, but is Blake Bortles good enough to contribute to a Super Bowl run."
  },
  {
    "week": 1,
    "ranking": 6,
    "team": "Los Angeles Rams",
    "blurb": "The Rams owned the offseason, and now Aaron Donald is back as well. Look out below."
  },
  {
    "week": 1,
    "ranking": 7,
    "team": "New Orleans Saints",
    "blurb": "Without Mark Ingram, who is suspended for the first four games, it’ll be up to second-year standout Alvin Kamara to produce a dazzling sequel."
  },
  {
    "week": 1,
    "ranking": 8,
    "team": "Atlanta Falcons",
    "blurb": "The Super Bowl will be in Atlanta this season. Will the Falcons be there, too?"
  },
  {
    "week": 1,
    "ranking": 9,
    "team": "Green Bay Packers",
    "blurb": "Aaron Rodgers is healthy and happy, after earning one heck of a paycheck this offseason. As he goes, so go the Packers."
  },
  {
    "week": 1,
    "ranking": 10,
    "team": "Carolina Panthers",
    "blurb": "The Panthers know what they have in veteran quarterback Cam Newton. The question is whether their offensive line will keep him upright."
  },
  {
    "week": 1,
    "ranking": 11,
    "team": "Los Angeles Chargers",
    "blurb": "There is reason for optimism in Los Angeles, and not just because of the Rams and Lakers. Good luck finding a more established pass-rushing duo than Joey Bosa and Melvin Ingram III."
  },
  {
    "week": 1,
    "ranking": 12,
    "team": "Kansas City Chiefs",
    "blurb": "The Patrick Mahomes era has begun in Kansas City. Now, we’ll all find out if the second-year quarterback is ready."
  },
  {
    "week": 1,
    "ranking": 13,
    "team": "Houston Texans",
    "blurb": "Deshaun Watson and J.J. Watt are back, and the Texans may be primed for the playoffs."
  },
  {
    "week": 1,
    "ranking": 14,
    "team": "Chicago Bears",
    "blurb": "Has the addition of Khalil Mack pushed the Bears into the playoff picture?"
  },
  {
    "week": 1,
    "ranking": 15,
    "team": "New York Giants",
    "blurb": "Eli Manning may not have anything left in the tank. But considering Saquon Barkley’s arrival and Odell Beckham Jr.’s big deal, it might not matter, either."
  },
  {
    "week": 1,
    "ranking": 16,
    "team": "Dallas Cowboys",
    "blurb": "Ezekiel Elliott is the primary focus offensively, but for the first time in years, Dallas has considerable questions along its offensive line."
  },
  {
    "week": 1,
    "ranking": 17,
    "team": "Seattle Seahawks",
    "blurb": "No Richard Sherman. No Kam Chancellor. No Michael Bennett. No Earl Thomas (for now). No telling what these Seahawks will look like in 2018."
  },
  {
    "week": 1,
    "ranking": 18,
    "team": "San Francisco 49ers",
    "blurb": "The 49ers closed the 2017 season with five consecutive wins. But was that a mirage or a sign of things to come?"
  },
  {
    "week": 1,
    "ranking": 19,
    "team": "Denver Broncos",
    "blurb": "Quarterback Case Keenum will attempt to resurrect the Broncos after an unexpected 5-11 tumble in 2017."
  },
  {
    "week": 1,
    "ranking": 20,
    "team": "Detroit Lions",
    "blurb": "It's first-year head coach Matt Patricia's job to turn around a group that finished 27th in total defense last season. Good luck."
  },
  {
    "week": 1,
    "ranking": 21,
    "team": "Oakland Raiders",
    "blurb": "Jon Gruden is back! But Khalil Mack isn't. The Raiders could be gearing up for an eventual rebuild."
  },
  {
    "week": 1,
    "ranking": 22,
    "team": "Baltimore Ravens",
    "blurb": "The Ravens, who kicked off the preseason by beating the Bears in the Hall of Fame Game, are the only team in the NFL to enjoy a 5-0 preseason. We'll see if that matters on Sunday."
  },
  {
    "week": 1,
    "ranking": 23,
    "team": "Tennessee Titans",
    "blurb": "The Titans made the playoffs in 2017, won a playoff game and then fired their head coach. I'm still trying to make sense of that whole situation."
  },
  {
    "week": 1,
    "ranking": 24,
    "team": "Arizona Cardinals",
    "blurb": "The good news for Arizona is that running back David Johnson is back. The bad news is that Sam Bradford is the Cardinals' starting quarterback."
  },
  {
    "week": 1,
    "ranking": 25,
    "team": "Cincinnati Bengals",
    "blurb": "The Bengals finished 31st in rushing offense and 27th in passing offense last season. And if you can't run, and you can't pass ... you get the idea."
  },
  {
    "week": 1,
    "ranking": 26,
    "team": "Indianapolis Colts",
    "blurb": "Andrew Luck's return is a bright spot for Indianapolis. The rest of its roster is not."
  },
  {
    "week": 1,
    "ranking": 27,
    "team": "Cleveland Browns",
    "blurb": "The Browns are still the Browns. Moving on."
  },
  {
    "week": 1,
    "ranking": 28,
    "team": "Buffalo Bills",
    "blurb": "The Bills announced this week that they will start Nathan Peterman at quarterback for the season opener. This does not inspire confidence."
  },
  {
    "week": 1,
    "ranking": 29,
    "team": "Washington",
    "blurb": "The Washington offense, which lost running back Derrius Guice for the season, looked dreadful during the preseason. We'll see if Alex Smith and Adrian Peterson can change that. "
  },
  {
    "week": 1,
    "ranking": 30,
    "team": "Tampa Bay Buccaneers",
    "blurb": "Quarterback Jameis Winston will be suspended for the Buccaneers' first three games. Tampa Bay could be in for a long season."
  },
  {
    "week": 1,
    "ranking": 31,
    "team": "New York Jets",
    "blurb": "Sam Darnold will be the Jets' starting quarterback on Sunday. The good news is that his first three opponents are the Lions, the Dolphins and the Browns."
  },
  {
    "week": 1,
    "ranking": 32,
    "team": "Miami Dolphins",
    "blurb": "Well, at least the fans still live in Miami. That should provide some consolation in 2018. "
  },
  {
    "week": 2,
    "ranking": 1,
    "team": "Philadelphia Eagles",
    "blurb": "The Eagles used the \"Philly Special\" to pick up another win. Real original."
  },
  {
    "week": 2,
    "ranking": 2,
    "team": "New England Patriots",
    "blurb": "Tom Brady threw for 277 yards and three touchdowns last weekend, despite having a no-name wide receiver corps. In other words, it's business as usual."
  },
  {
    "week": 2,
    "ranking": 3,
    "team": "Minnesota Vikings",
    "blurb": "The punishing Minnesota defense forced four San Francisco turnovers in its season opener. That isn't a fluke."
  },
  {
    "week": 2,
    "ranking": 4,
    "team": "Los Angeles Rams",
    "blurb": "Todd Gurley and Jared Goff were both sharp in the Rams' season opener. When they're rolling like that, who can stop them?"
  },
  {
    "week": 2,
    "ranking": 5,
    "team": "Jacksonville Jaguars",
    "blurb": "acksonville's offense was underwhelming already. If Leonard Fournette has to miss any time with a hamstring injury, the Jaguars might be in trouble."
  },
  {
    "week": 2,
    "ranking": 6,
    "team": "Carolina Panthers",
    "blurb": "Carolina's defense held the Dallas Cowboys to just eight points, 232 total yards and 94 rushing yards last week. That's an impressive start."
  },
  {
    "week": 2,
    "ranking": 7,
    "team": "Kansas City Chiefs",
    "blurb": "The Patrick Mahomes era kicked off with four touchdown passes in an impressive 38-28 win over the Chargers. All aboard the hype train."
  },
  {
    "week": 2,
    "ranking": 8,
    "team": "Denver Broncos",
    "blurb": "The Broncos' pass rush is still fearsome, but Case Keenum needs to be better if the Broncos are going to make a serious run."
  },
  {
    "week": 2,
    "ranking": 9,
    "team": "Atlanta Falcons",
    "blurb": "The Falcons scored just 10 points in five red zone trips last week. Matt Ryan, Julio Jones and Co. have work to do."
  },
  {
    "week": 2,
    "ranking": 10,
    "team": "Baltimore Ravens",
    "blurb": "How impressive is a 47-3 win when it comes over the lowly Bills? We'll find out when the Ravens meet the Bengals on Thursday."
  },
  {
    "week": 2,
    "ranking": 11,
    "team": "Green Bay Packers",
    "blurb": "If Aaron Rodgers has to miss any time with a knee injury, the ship might sink in Green Bay."
  },
  {
    "week": 2,
    "ranking": 12,
    "team": "New York Giants",
    "blurb": "Saquon Barkley and Odell Beckham did their part in the Giants' season-opening loss to Jacksonville. Now Eli Manning needs to do his."
  },
  {
    "week": 2,
    "ranking": 13,
    "team": "Los Angeles Chargers",
    "blurb": "The Chargers didn't have Joey Bosa last weekend ... and it showed."
  },
  {
    "week": 2,
    "ranking": 14,
    "team": "Pittsburgh Steelers",
    "blurb": "Le'Veon, Le'Veon, wherefore art thou, Le'Veon?"
  },
  {
    "week": 2,
    "ranking": 15,
    "team": "Tampa Bay Buccaneers",
    "blurb": "Ryan Fitzpatrick threw for 417 yards and four touchdowns on the road against the Saints. You figure it out."
  },
  {
    "week": 2,
    "ranking": 16,
    "team": "Cleveland Browns",
    "blurb": "For the first time since Dec. 24, 2016, the Browns didn't lose. But they didn't win, either."
  },
  {
    "week": 2,
    "ranking": 17,
    "team": "Chicago Bears",
    "blurb": "The Bears led the Packers 20-0 late in the third quarter last weekend. They're 0-1. That's Aaron Rodgers."
  },
  {
    "week": 2,
    "ranking": 18,
    "team": "Cincinnati Bengals",
    "blurb": "Maybe the Bengals' offense really is improved. Or maybe we just think so because they picked on the hapless Colts."
  },
  {
    "week": 2,
    "ranking": 19,
    "team": "Houston Texans",
    "blurb": "Deshaun Watson's return from a torn ACL wasn't enough for the Texans to upright the Patriots in New England."
  },
  {
    "week": 2,
    "ranking": 20,
    "team": "Seattle Seahawks",
    "blurb": "Doug Baldwin is down and the Seahawks' pass rush is non-existent. Oh, and that offensive line has to protect Russell Wilson from Khalil Mack on Monday night."
  },
  {
    "week": 2,
    "ranking": 21,
    "team": "San Francisco 49ers",
    "blurb": "Jimmy Garoppolo completed just 45.5 percent of his passes and threw three interceptions against Minnesota. Not exactly how you make good on that massive offseason contract."
  },
  {
    "week": 2,
    "ranking": 22,
    "team": "New Orleans Saints",
    "blurb": "The Saints gave up 48 points and lost to the Bucs -- yes, the Bucs -- at home. Did anyone see that coming?"
  },
  {
    "week": 2,
    "ranking": 23,
    "team": "Dallas Cowboys",
    "blurb": "Dallas, which has made its name by running the football, managed just 94 rushing yards in a loss to the Panthers. The pressure's on Dak Prescott."
  },
  {
    "week": 2,
    "ranking": 24,
    "team": "New York Jets",
    "blurb": "After throwing a pick-six on his first NFL pass, Sam Darnold settled down and led the Jets to a road win. So far, so good."
  },
  {
    "week": 2,
    "ranking": 25,
    "team": "Oakland Raiders",
    "blurb": "Derek Carr's three interceptions helped spoil Jon Gruden's Black Hole homecoming in Oakland."
  },
  {
    "week": 2,
    "ranking": 26,
    "team": "Miami Dolphins",
    "blurb": "Miami's game last weekend lasted more than seven hours because of weather delays. But hey, a win's a win."
  },
  {
    "week": 2,
    "ranking": 27,
    "team": "Washington",
    "blurb": "Adrian Peterson provided a blast from the past in Washington's season opener, producing 166 total yards and a touchdown in the win over Arizona."
  },
  {
    "week": 2,
    "ranking": 28,
    "team": "Tennessee Titans",
    "blurb": "Marcus Mariota's status is unknown with an elbow injury. Good luck with Blaine Gabbert, Titans fans!"
  },
  {
    "week": 2,
    "ranking": 29,
    "team": "Indianapolis Colts",
    "blurb": "Andrew Luck is back! Unfortunately the can't be said for Edgerrin James and Reggie Wayne."
  },
  {
    "week": 2,
    "ranking": 30,
    "team": "Arizona Cardinals",
    "blurb": "The Cardinals produced just 213 total yards and six points in Sam Bradford's Arizona debut. Josh Rosen better start warming up."
  },
  {
    "week": 2,
    "ranking": 31,
    "team": "Detroit Lions",
    "blurb": "Matt Stafford threw four interceptions and the Lions were blown out at home by a rookie quarterback making his first career start. Not a great first impression for Matt Patricia."
  },
  {
    "week": 2,
    "ranking": 32,
    "team": "Buffalo Bills",
    "blurb": "After making the playoffs in 2017, the Bills lost 47-3 to the Baltimore Ravens last weekend. It's only a matter of time until Buffalo is on the clock."
  },
  {
    "week": 3,
    "ranking": 1,
    "team": "Los Angeles Rams",
    "blurb": "The Rams have outscored their opponents 77-13 in their first two games."
  },
  {
    "week": 3,
    "ranking": 2,
    "team": "Jacksonville Jaguars",
    "blurb": "Jacksonville made a statement with a decisive home win over New England last week. If Blake Bortles is good, the Jaguars are great."
  },
  {
    "week": 3,
    "ranking": 3,
    "team": "Kansas City Chiefs",
    "blurb": "Patrick Mahomes has thrown 10 touchdown passes with zero interceptions in his first two games. Who needs Alex Smith, anyway?"
  },
  {
    "week": 3,
    "ranking": 4,
    "team": "Tampa Bay Buccaneers",
    "blurb": "I have to be honest: I didn't see this coming. With Ryan Fitzpatrick as their quarterback, the Bucs have beaten two of the NFL's preseason favorites to start their season. "
  },
  {
    "week": 3,
    "ranking": 5,
    "team": "Minnesota Vikings",
    "blurb": "The Vikings left Green Bay with a tie last weekend, but they also saw quarterback Kirk Cousins at his best, and that's a good sign going forward."
  },
  {
    "week": 3,
    "ranking": 6,
    "team": "Philadelphia Eagles",
    "blurb": "The bad news is that Philadelphia lost to the surprising Bucs last weekend. The good news: quarterback Carson Wentz is back."
  },
  {
    "week": 3,
    "ranking": 7,
    "team": "New England Patriots",
    "blurb": "The Patriots allowed 377 passing yards and four touchdown passes to Blake Bortles last weekend. You read that right."
  },
  {
    "week": 3,
    "ranking": 8,
    "team": "Green Bay Packers",
    "blurb": "As long as the Packers have arguably the best quarterback on Earth, they'll be a playoff contender."
  },
  {
    "week": 3,
    "ranking": 9,
    "team": "Cincinnati Bengals",
    "blurb": "Andy Dalton has thrown six touchdown passes and just one interception in his first two games. But the Colts and Ravens aren't exactly prime competition, either."
  },
  {
    "week": 3,
    "ranking": 10,
    "team": "Denver Broncos",
    "blurb": "The Broncos led the Raiders for exactly six seconds last Sunday. Six seconds were enough."
  },
  {
    "week": 3,
    "ranking": 11,
    "team": "Atlanta Falcons",
    "blurb": "In a match up of Matt Ryan and Cam Newton, the quarterback who ran for two touchdowns last weekend was Ryan. Really."
  },
  {
    "week": 3,
    "ranking": 12,
    "team": "Miami Dolphins",
    "blurb": "The Dolphins are 2-0, but those wins have come against the Titans (without Marcus Mariota) and the Jets. I remain unconvinced. "
  },
  {
    "week": 3,
    "ranking": 13,
    "team": "Carolina Panthers",
    "blurb": "The Panthers' offense is essentially all Cam Newton and Christian McCaffrey. The latter caught 14 -- yes, 14 -- passes last weekend from the running back position."
  },
  {
    "week": 3,
    "ranking": 14,
    "team": "Los Angeles Chargers",
    "blurb": "Phillip Rivers completed 85 percent of his passes in a win over the lowly Bills last week. That'll work."
  },
  {
    "week": 3,
    "ranking": 15,
    "team": "New Orleans Saints",
    "blurb": "Michael Thomas continues to establish himself as one of the top wide receivers in the NFL, after racking up 12 catches and two touchdowns in a win over Cleveland last week."
  },
  {
    "week": 3,
    "ranking": 16,
    "team": "Dallas Cowboys",
    "blurb": "The Cowboys' defense looks formidable. In last week's win over the Giants, rookie running back Saquon Barkley managed just 28 rushing yards on 11 carries."
  },
  {
    "week": 3,
    "ranking": 17,
    "team": "Chicago Bears",
    "blurb": "The 1-1 Bears will have a chance to start a winning streak on Sunday when they play one of the worst teams in the NFL, the Arizona Cardinals."
  },
  {
    "week": 3,
    "ranking": 18,
    "team": "San Francisco 49ers",
    "blurb": "The 49ers are not winless, but they did just barely skate by a thoroughly mediocre Lions team at home. The jury is still out on San Francisco. "
  },
  {
    "week": 3,
    "ranking": 19,
    "team": "Baltimore Ravens",
    "blurb": "Baltimore's defense couldn't stop Cincinnati last week. The Ravens need linebacker C.J. Mosley (bone bruise) to return, and soon."
  },
  {
    "week": 3,
    "ranking": 20,
    "team": "Pittsburgh Steelers",
    "blurb": "Ben Roethlisberger threw 60 times last week. That's an offense that misses Le'Veon Bell."
  },
  {
    "week": 3,
    "ranking": 21,
    "team": "Tennessee Titans",
    "blurb": "The Titans topped the Texans last week despite being outgained by 154 yards and forcing zero turnovers. It's hard to believe the better team won."
  },
  {
    "week": 3,
    "ranking": 22,
    "team": "Indianapolis Colts",
    "blurb": "The Colts' defense held Washington to just 65 rushing yards and nine points last week. It'll be hard to replicate that performance against the Eagles on Sunday."
  },
  {
    "week": 3,
    "ranking": 23,
    "team": "New York Jets",
    "blurb": "Through two games, rookie quarterback Sam Darnold has completed 66.1 percent of his passes, throwing for three touchdowns and three interceptions. "
  },
  {
    "week": 3,
    "ranking": 24,
    "team": "Cleveland Browns",
    "blurb": "Zane Gonzalez missed two field goals and two extra points against the Saints last week, essentially costing the Browns the game. Unsurprisingly, Gonzalez is now a free agent."
  },
  {
    "week": 3,
    "ranking": 25,
    "team": "Seattle Seahawks",
    "blurb": "The Seahawks need to get Bobby Wagner, K.J. Wright and Doug Baldwin back from injury. They also desperately need a win in their home opener against Dallas."
  },
  {
    "week": 3,
    "ranking": 26,
    "team": "Houston Texans",
    "blurb": "The Texans are 0-2. But at least they've got Will Fuller, who returned from an injury to catch eight passes for 113 yards and a touchdown last week."
  },
  {
    "week": 3,
    "ranking": 27,
    "team": "Washington",
    "blurb": "Washington is 1-1, but things could go south in a hurry. Its next four games are against Green Bay, New Orleans, Carolina and Dallas."
  },
  {
    "week": 3,
    "ranking": 28,
    "team": "Oakland Raiders",
    "blurb": "The Raiders are 0-2, but they've got a chance to rebound with upcoming games against Miami and Cleveland."
  },
  {
    "week": 3,
    "ranking": 29,
    "team": "New York Giants",
    "blurb": "Eli Manning was sacked six times last week and Saquon Barkley ran for just 28 yards. Not exactly how they drew it up."
  },
  {
    "week": 3,
    "ranking": 30,
    "team": "Detroit Lions",
    "blurb": "Detroit hired a renowned defensive coordinator as its head coach, then promptly allowed 78 points in its first two games. Figures."
  },
  {
    "week": 3,
    "ranking": 31,
    "team": "Arizona Cardinals",
    "blurb": "The bad news is that the Cardinals have scored a total of six points in their first two games and Sam Bradford is averaging a staggering four yards per attempt. There is no good news."
  },
  {
    "week": 3,
    "ranking": 32,
    "team": "Buffalo Bills",
    "blurb": "Bills cornerback Vontae Davis retired at halftime last week. And really, can you blame him?"
  },
  {
    "week": 4,
    "ranking": 1,
    "team": "Los Angeles Rams",
    "blurb": "The Rams have outscored their opponents 102-36 in their three wins. They'll have a challenge at home on Sunday against Minnesota's defense."
  },
  {
    "week": 4,
    "ranking": 2,
    "team": "Kansas City Chiefs",
    "blurb": "Patrick Mahomes has completed 66.7 percent of his passes, throwing 13 touchdown passes and zero interceptions. Safe to say the Chiefs have moved on from Alex Smith."
  },
  {
    "week": 4,
    "ranking": 3,
    "team": "Miami Dolphins",
    "blurb": "The Dolphins are 3-0 for the first time since 2013. They lost their next four games that season. They'll try to buck that trend in New England on Sunday. "
  },
  {
    "week": 4,
    "ranking": 4,
    "team": "Philadelphia Eagles",
    "blurb": "Carson Wentz is officially back from a torn ACL. Can that addition spark the Eagles' offense?"
  },
  {
    "week": 4,
    "ranking": 5,
    "team": "New Orleans Saints",
    "blurb": "Drew Brees threw for 396 yards and three touchdowns last weekend and ran for two more scores. The 39-year-old quarterback doesn't seem to be slowing down."
  },
  {
    "week": 4,
    "ranking": 6,
    "team": "Tennessee Titans",
    "blurb": "The Titans allowed just six points to Jacksonville last weekend and got quarterback Marcus Mariota back from injury. Next comes a test against the Super Bowl champion Eagles."
  },
  {
    "week": 4,
    "ranking": 7,
    "team": "Jacksonville Jaguars",
    "blurb": "The Jaguars thumped the Patriots and then scored six points in a loss to the Titans. It's hard to know what to make of Jacksonville at this point."
  },
  {
    "week": 4,
    "ranking": 8,
    "team": "Tampa Bay Buccaneers",
    "blurb": "The Fitzmagic ran out on Monday Night Football, as Ryan Fitzpatrick's three interceptions effectively sank the Buccaneers."
  },
  {
    "week": 4,
    "ranking": 9,
    "team": "Washington",
    "blurb": "Hello, Adrian Peterson. The veteran running back has reignited himself to the tune of 236 rushing yards, 4.2 yards per carry and three touchdowns in three games."
  },
  {
    "week": 4,
    "ranking": 10,
    "team": "Chicago Bears",
    "blurb": "Call it the Khalil Mack effect if you want to, but the 2-1 Bears lead the NFL with 14 sacks in three games."
  },
  {
    "week": 4,
    "ranking": 11,
    "team": "Carolina Panthers",
    "blurb": "Christian McCaffrey continues to be the focal point of the Panthers' offense, with 194 total yards in a win over the Bengals last weekend."
  },
  {
    "week": 4,
    "ranking": 12,
    "team": "Baltimore Ravens",
    "blurb": "The Ravens' pass defense has been a menace so far, rankings second in the NFL in opposing passer rating (67.6)."
  },
  {
    "week": 4,
    "ranking": 13,
    "team": "Denver Broncos",
    "blurb": "The jury is out on quarterback Case Keenum, who has thrown more interceptions (5) than touchdowns (3) and hasn't thrown a TD pass since the season opener."
  },
  {
    "week": 4,
    "ranking": 14,
    "team": "Cincinnati Bengals",
    "blurb": "Andy Dalton threw four interceptions in a loss to the Panthers last week. The Bengals hit the road to take on the Falcons on Sunday."
  },
  {
    "week": 4,
    "ranking": 15,
    "team": "Minnesota Vikings",
    "blurb": "How exactly did the Vikings get throttled at home by Josh Allen and the winless Bills? Days later, the answer is still a mystery."
  },
  {
    "week": 4,
    "ranking": 16,
    "team": "Green Bay Packers",
    "blurb": "Despite a lingering knee injury, quarterback Aaron Rodgers has thrown for 832 yards with six touchdowns and zero interceptions."
  },
  {
    "week": 4,
    "ranking": 17,
    "team": "Cleveland Browns",
    "blurb": "The Browns picked up their first win last week since Dec. 24, 2016. They can start a winning streak on Sunday against the Oakland Raiders."
  },
  {
    "week": 4,
    "ranking": 18,
    "team": "Pittsburgh Steelers",
    "blurb": "Ben Roethlisbeger had a prolific performance on Monday night, throwing for 353 yards with three touchdowns and an interception. The Steelers are going to need him."
  },
  {
    "week": 4,
    "ranking": 19,
    "team": "New England Patriots",
    "blurb": "What's going on here? The Patriots fell to the winless Detroit Lions last weekend. Not they'll have to contend with the undefeated Miami Dolphins."
  },
  {
    "week": 4,
    "ranking": 20,
    "team": "Atlanta Falcons",
    "blurb": "Matt Ryan's 374 passing yards and five touchdowns weren't enough in a loss to the New Orleans Saints. The Falcons will hope to rebound against the Bengals on Sunday. "
  },
  {
    "week": 4,
    "ranking": 21,
    "team": "Los Angeles Chargers",
    "blurb": "The Chargers lost the battle of Los Angeles to the Rams last weekend. Maybe now they'll wise up and move back to San Diego."
  },
  {
    "week": 4,
    "ranking": 22,
    "team": "Seattle Seahawks",
    "blurb": "The Seahawks have a real opportunity to mount a winning streak, with the 0-3 Cardinals next on the schedule. But will Earl Thomas make the trip to Phoenix?"
  },
  {
    "week": 4,
    "ranking": 23,
    "team": "Buffalo Bills",
    "blurb": "The Bills dominated the Vikings last weekend, because life is meaningless and nothing makes sense."
  },
  {
    "week": 4,
    "ranking": 24,
    "team": "Detroit Lions",
    "blurb": "Matt Patricia's defense finally woke up in a win over his former team, the Patriots, last weekend. Now it gets to feed on the Cowboys' struggling offense."
  },
  {
    "week": 4,
    "ranking": 25,
    "team": "Dallas Cowboys",
    "blurb": "Dak Prescott has passed for just 145 yards per game and has just two touchdown passes to his name. Good luck naming the Cowboys' starting wide receivers."
  },
  {
    "week": 4,
    "ranking": 26,
    "team": "New York Giants",
    "blurb": "Eli Manning completed 86.2 percent of his passes in a win over the Texans last weekend, which tells you all you need to know about the Texans' secondary."
  },
  {
    "week": 4,
    "ranking": 27,
    "team": "New York Jets",
    "blurb": "The Jets lost to the Browns and a quarterback making the first appearance of his NFL career. The clock is ticking for Todd Bowles. "
  },
  {
    "week": 4,
    "ranking": 28,
    "team": "Indianapolis Colts",
    "blurb": "The good news is that Andrew Luck is back. The bad news is that he averaged just 4.1 yards per attempt against the Eagles."
  },
  {
    "week": 4,
    "ranking": 29,
    "team": "San Francisco 49ers",
    "blurb": "Jimmy Garoppolo's season is over because of a torn ACL. And guess what? The 49ers' season is essentially over, too."
  },
  {
    "week": 4,
    "ranking": 30,
    "team": "Houston Texans",
    "blurb": "The Texans have been outscored 55-19 in the first half this season. And yet, all three of their losses were one-score games."
  },
  {
    "week": 4,
    "ranking": 31,
    "team": "Oakland Raiders",
    "blurb": "Jon Gruden's Raiders are 0-3 and that Monday Night Football booth is looking cozier by the minute."
  },
  {
    "week": 4,
    "ranking": 32,
    "team": "Arizona Cardinals",
    "blurb": "The Cardinals rank dead last in scoring offense, with 20 total points in three games. Good luck, Josh Rosen."
  },
  {
    "week": 5,
    "ranking": 1,
    "team": "Los Angeles Rams",
    "blurb": "The Rams are undefeated and lead the NFL in total offense. Next up: a Seahawks secondary without Earl Thomas."
  },
  {
    "week": 5,
    "ranking": 2,
    "team": "Kansas City Chiefs",
    "blurb": "The Chiefs passed their first serious test of 2018, overcoming a 10-point fourth-quarter deficit to defeat the Broncos and remain undefeated."
  },
  {
    "week": 5,
    "ranking": 3,
    "team": "Tennessee Titans",
    "blurb": "Doubt if you must, but the Titans have topped the Jaguars and Eagles in back-to-back weeks. Better yet, they meet the hopeless Bills on Sunday."
  },
  {
    "week": 5,
    "ranking": 4,
    "team": "Jacksonville Jaguars",
    "blurb": "No surprise here, but the Jaguars lead the NFL in scoring defense and total defense. If Blake Bortles doesn't self-destruct, they win."
  },
  {
    "week": 5,
    "ranking": 5,
    "team": "New Orleans Saints",
    "blurb": "Alvin Kamara had 181 total yards and three touchdowns last weekend, and the Saints now get Mark Ingram back from suspension. That offense is scary."
  },
  {
    "week": 5,
    "ranking": 6,
    "team": "Chicago Bears",
    "blurb": "Mitch Trubisky threw for 354 yards and six (!) touchdowns last weekend. Are the Bears that good, or are the Bucs that bad?"
  },
  {
    "week": 5,
    "ranking": 7,
    "team": "Washington",
    "blurb": "Washington ranks second in the NFL in scoring defense and third in total defense. That defense will be tested against the Saints on Monday night."
  },
  {
    "week": 5,
    "ranking": 8,
    "team": "Cincinnati Bengals",
    "blurb": "The Bengals lost tight end Tyler Eifert last weekend but continue to get huge contributions from wide receiver Tyler Boyd, who caught 11 passes against the Falcons."
  },
  {
    "week": 5,
    "ranking": 9,
    "team": "Baltimore Ravens",
    "blurb": "The Ravens won in Pittsburgh last week and travel to Cleveland on Sunday with a chance to pull ahead in the AFC North."
  },
  {
    "week": 5,
    "ranking": 10,
    "team": "Carolina Panthers",
    "blurb": "On the heels of a bye week, newly-signed safety Eric Reid will make his Panthers debut in a home game against the Giants on Sunday."
  },
  {
    "week": 5,
    "ranking": 11,
    "team": "Miami Dolphins",
    "blurb": "The Dolphins' undefeated season was harpooned by the Patriots last week. Now it's up to Ryan Tannehill and Co. to pick up the pieces against two potential playoff teams in Cincinnati and Chicago."
  },
  {
    "week": 5,
    "ranking": 12,
    "team": "Green Bay Packers",
    "blurb": "The Packers have winnable games against the Lions and 49ers on the horizon. Their playoff hopes continue to rest on Aaron Rodgers' arm (and knee)."
  },
  {
    "week": 5,
    "ranking": 13,
    "team": "New England Patriots",
    "blurb": "Have the mighty Patriots awoken from their slumber? We'll find out when 2-2 New England hosts a former rival in the Colts on Thursday night."
  },
  {
    "week": 5,
    "ranking": 14,
    "team": "Philadelphia Eagles",
    "blurb": "Something is missing in Philadelphia. The good news is that wide receiver Alshon Jeffrey returned and produced eight catches for 105 yards and a touchdown in last week's loss to the Titans."
  },
  {
    "week": 5,
    "ranking": 15,
    "team": "Denver Broncos",
    "blurb": "The Broncos won their first two games by a comined four points and have since lost two straight. Things are trending downward in Denver,"
  },
  {
    "week": 5,
    "ranking": 16,
    "team": "Los Angeles Chargers",
    "blurb": "The Chargers eked past the 49ers last weekend, no thanks to placekicker Caleb Sturgis, who missed two extra points and a field goal attempt. In other words, the Chargers may be in the market for a kicker."
  },
  {
    "week": 5,
    "ranking": 17,
    "team": "Seattle Seahawks",
    "blurb": "The good news? The Seahawks have won two consecutive games. The bad news? They now run into the Rams without arguably their best player in Earl Thomas."
  },
  {
    "week": 5,
    "ranking": 18,
    "team": "Dallas Cowboys",
    "blurb": "The Cowboys needed a last-second field goal to drop Detroit last weekend. Running back Ezekiel Elliott ripped off 240 total yards and a touchdown in the win."
  },
  {
    "week": 5,
    "ranking": 19,
    "team": "Tampa Bay Buccaneers",
    "blurb": "Well, the Fitzmagic is officially gone. After two consecutive losses, the Bucs limp into the bye week with a decision to make regarding its starting quarterback."
  },
  {
    "week": 5,
    "ranking": 20,
    "team": "Minnesota Vikings",
    "blurb": "Whatever happened to that vaunted Vikings defense? That group ranks 21st in total defense and 22nd in scoring defense. They meet Philadelphia on Sunday in a game both teams need to win."
  },
  {
    "week": 5,
    "ranking": 21,
    "team": "Cleveland Browns",
    "blurb": "The Browns have tied one game and lost two more by a total of six points. Still, nearly winning doesn't count for much in the NFL."
  },
  {
    "week": 5,
    "ranking": 22,
    "team": "Pittsburgh Steelers",
    "blurb": "The Steelers were shut out in the second half of a home loss to division rival Baltimore last week. The LeVeon-less Steelers ran for a total of 19 yards on the night."
  },
  {
    "week": 5,
    "ranking": 23,
    "team": "Houston Texans",
    "blurb": "The Texans needed overtime to secure their first win of the season, over the Indianapolis Colts. Quarterback Deshaun Watson threw for 375 yards and two touchdowns and ran for another score."
  },
  {
    "week": 5,
    "ranking": 24,
    "team": "Atlanta Falcons",
    "blurb": "Dan Quinn's once-mighty Falcons defense has allowed 80 points in its last two games. Even Matt Ryan, Julio Jones and Calvin Ridley can't close that gap."
  },
  {
    "week": 5,
    "ranking": 25,
    "team": "Indianapolis Colts",
    "blurb": "Andrew Luck broke out against the Texans, passing 62 times for 464 yards and four touchdowns. But the Colts still lost, because they're the Colts."
  },
  {
    "week": 5,
    "ranking": 26,
    "team": "Detroit Lions",
    "blurb": "The Lions have beaten the Patriots and lost to the Jets, 49ers and Cowboys, who own a combined 1-8 record against the rest of the NFL. That was a confusing sentence."
  },
  {
    "week": 5,
    "ranking": 27,
    "team": "San Francisco 49ers",
    "blurb": "The 49ers are 0-1 in the C.J. Beathard Era this season. Without injured quarterback Jimmy Garoppolo, Beathard threw for 298 yards with two touchdowns and two interceptions against the Chargers."
  },
  {
    "week": 5,
    "ranking": 28,
    "team": "Oakland Raiders",
    "blurb": "Like the Texans, the Raiders needed overtime to beat a bad team and secure their first win. And like the Texans, the Raiders are not very good."
  },
  {
    "week": 5,
    "ranking": 29,
    "team": "New York Giants",
    "blurb": "Maybe the Giants have just gotten a tough early draw, with two of their three losses coming against the Jaguars and Saints. It won't get much easier with a road game at Carolina on Sunday."
  },
  {
    "week": 5,
    "ranking": 30,
    "team": "New York Jets",
    "blurb": "The Jets have averaged 13.7 points per game in their three consecutive losses. That's no surprise with a rookie quarterback (Sam Darnold) and few proven offensive weapons."
  },
  {
    "week": 5,
    "ranking": 31,
    "team": "Buffalo Bills",
    "blurb": "The Bills were shut out in Green Bay last weekend and Josh Allen completed less than half of his passes and threw two interceptions. It's going to be a bumpy ride."
  },
  {
    "week": 5,
    "ranking": 32,
    "team": "Arizona Cardinals",
    "blurb": "The bottom three teams in these power rankings are starting rookie quarterbacks. Can that be a coincidence? Probably not."
  },
  {
    "week": 6,
    "ranking": 1,
    "team": "Kansas City Chiefs",
    "blurb": "The Chiefs put up 30 points on one of the premier defenses in football to remain undefeated and claim the top spot in this week's rankings."
  },
  {
    "week": 6,
    "ranking": 2,
    "team": "Los Angeles Rams",
    "blurb": "The Rams' win in Seattle was not very convincing, but Todd Gurley II still ran for three touchdowns and Jared Goff threw for 321 yards to seal the deal."
  },
  {
    "week": 6,
    "ranking": 3,
    "team": "New Orleans Saints",
    "blurb": "Drew Brees completed an astronomical 26 of 29 passes (89.7 percent) in a Monday night win over Washington, throwing for 363 yards and passing Peyton Manning to claim the NFL career passing yard record in the process."
  },
  {
    "week": 6,
    "ranking": 4,
    "team": "Chicago Bears",
    "blurb": "The Bears come out of a bye with a 3-1 record and perhaps the best defensive player in football in linebacker Khalil Mack."
  },
  {
    "week": 6,
    "ranking": 5,
    "team": "Cincinnati Bengals",
    "blurb": "The Bengals are 4-1, but here's where things get tricky. Their next two games are against two playoff contenders in the Steelers and Chiefs."
  },
  {
    "week": 6,
    "ranking": 6,
    "team": "Carolina Panthers",
    "blurb": "Yes, Carolina needed a 63-yard Graham Gano field goal to top the 1-4 Giants. But at 4-1, the Panthers are tied with the Saints atop the NFC South."
  },
  {
    "week": 6,
    "ranking": 7,
    "team": "New England Patriots",
    "blurb": "I'm going to go out on a limb here and say that the Patriots are the best 3-2 team in the NFL. They can prove it against the undefeated Chiefs on Sunday."
  },
  {
    "week": 6,
    "ranking": 8,
    "team": "Jacksonville Jaguars",
    "blurb": "Blake Bortles completed 33 of 61 passes (64.1 percent) for 430 yards with one touchdown and four interceptions in a loss to the Chiefs last week. Maybe it's best not to let Bortles throw 61 times?"
  },
  {
    "week": 6,
    "ranking": 9,
    "team": "Los Angeles Chargers",
    "blurb": "The Chargers' three wins have come against three of the worst teams in the NFL (Bills, 49ers and Raiders) and their two losses have come against arguably the two best teams (Chiefs and Rams). So ... are the Chargers good?"
  },
  {
    "week": 6,
    "ranking": 10,
    "team": "Minnesota Vikings",
    "blurb": "The Vikings have produced a surprisingly shaky start, but back-to-back games against the Cardinals and Jets should help them right the ship."
  },
  {
    "week": 6,
    "ranking": 11,
    "team": "Pittsburgh Steelers",
    "blurb": "Despite a 2-2-1 record, the Steelers are somehow in last place in the AFC North. A win on Sunday against the division-leading Bengals would change that."
  },
  {
    "week": 6,
    "ranking": 12,
    "team": "Miami Dolphins",
    "blurb": "Ryan Tannehil has completed just 56.4 percent of his passes in the last two weeks, throwing for 285 yards with one touchdowns and three interceptions. That's not going to cut it."
  },
  {
    "week": 6,
    "ranking": 13,
    "team": "Cleveland Browns",
    "blurb": "The Browns have already played three overtimes, won two games by seven combined points and lost two games by six total points. They may not be good, but they're close."
  },
  {
    "week": 6,
    "ranking": 14,
    "team": "Baltimore Ravens",
    "blurb": "The Ravens were 4-16 on third down against the Browns last week, which might help explain their nine total points."
  },
  {
    "week": 6,
    "ranking": 15,
    "team": "Tennessee Titans",
    "blurb": "The Titans finished with 221 total yards in a loss to the Bills last week. They now rank 29th in the NFL in total offense (294 yards per game)."
  },
  {
    "week": 6,
    "ranking": 16,
    "team": "Washington",
    "blurb": "Washington rushed for just 39 yards and 2.2 yards per carry against a supposedly porous Saints defense last week. It won't get much easier against Carolina on Sunday."
  },
  {
    "week": 6,
    "ranking": 17,
    "team": "Tampa Bay Buccaneers",
    "blurb": "Jameis Winston will make his first start of the season against the 1-4 Falcons on Sunday. Considering Tampa Bay's horrendous defense, it might not matter."
  },
  {
    "week": 6,
    "ranking": 18,
    "team": "Green Bay Packers",
    "blurb": "Aaron Rodgers threw for 442 yards and three touchdowns last week and the Packers still lost to the 2-3 Lions. Of course, three turnovers didn't help."
  },
  {
    "week": 6,
    "ranking": 19,
    "team": "Detroit Lions",
    "blurb": "The Lions have beaten the Patriots and Packers and lost to the Jets, 49ers and Cowboys, because life is meaningless and the NFL makes no sense."
  },
  {
    "week": 6,
    "ranking": 20,
    "team": "Philadelphia Eagles",
    "blurb": "Things are looking bleak for the Eagles, who have lost two straight games and will continue without the services of starting running back Jay Ajayi (torn ACL)."
  },
  {
    "week": 6,
    "ranking": 21,
    "team": "Seattle Seahawks",
    "blurb": "After nearly upsetting the Rams last week, the Seahawks have an opportunity against the Raiders (1-4) and Lions (2-3) (with a bye week in between) to make a move up the rankings."
  },
  {
    "week": 6,
    "ranking": 22,
    "team": "Houston Texans",
    "blurb": "Deshaun Watson showcase his entire arsenal in an overtime win over the Cowboys last weekend, throwing for 375 yards and a touchdown and running for 40 more yards."
  },
  {
    "week": 6,
    "ranking": 23,
    "team": "New York Jets",
    "blurb": "Journeyman running back Isaiah Crowell has a career day against the Broncos last weekend, rushing for 219 yards and a touchdown on just 15 carries."
  },
  {
    "week": 6,
    "ranking": 24,
    "team": "Buffalo Bills",
    "blurb": "The Bills finished with 223 total yards and went 4-13 on third down last week ... and won. Rookie quarterback Josh Allen completed just 10 of 19 passes for 82 yards and an interception."
  },
  {
    "week": 6,
    "ranking": 25,
    "team": "Denver Broncos",
    "blurb": "The Broncos rank 30th in the NFL in rushing defense (139.6 yards per game) and opponent yards per carry (5.3). That's not a winning formula."
  },
  {
    "week": 6,
    "ranking": 26,
    "team": "Dallas Cowboys",
    "blurb": "The Cowboys rank 30th in the NFL in scoring offense, averaging just 16.6 points per game. The two teams behind them? The 1-4 Cardinals and the 2-3 Bills."
  },
  {
    "week": 6,
    "ranking": 27,
    "team": "Atlanta Falcons",
    "blurb": "How did the Falcons fall so far, so fast? They've lost three consecutive games and Dan Quinn's defense has allowed an average of 40.3 points per game during that span."
  },
  {
    "week": 6,
    "ranking": 28,
    "team": "Indianapolis Colts",
    "blurb": "Yes, the Colts are 1-4. But if you're looking for good news, quarterback Andrew Luck has thrown for 829 yards and seven touchdowns in his last two games."
  },
  {
    "week": 6,
    "ranking": 29,
    "team": "New York Giants",
    "blurb": "Three of the Giants' four losses have been by seven points or less. Still, that serves as little consolation in New York."
  },
  {
    "week": 6,
    "ranking": 30,
    "team": "Oakland Raiders",
    "blurb": "The Raiders are dead last in the NFL with just six sacks in five games this season. If only they had a dominant pass-rusher in his prime ..."
  },
  {
    "week": 6,
    "ranking": 31,
    "team": "Arizona Cardinals",
    "blurb": "Despite being outgained by 227 yards, the Cardinals beat the 49ers by 10 points last week. Five turnovers made that possible. "
  },
  {
    "week": 6,
    "ranking": 32,
    "team": "San Francisco 49ers",
    "blurb": "The two worst teams in the NFL both reside in the NFC West. I guess that qualifies as good news for the Seahawks."
  },
  {
    "week": 7,
    "ranking": 1,
    "team": "Los Angeles Rams (6-0)",
    "blurb": "The Rams have beaten their last two opponents by five total points, but they're now the only undefeated team in the NFL."
  },
  {
    "week": 7,
    "ranking": 2,
    "team": "New England Patriots (4-2)",
    "blurb": "Wait, so the Patriots aren't dead? New England has won three straight, most recently making a statement by dispatching undefeated Kansas City in prime time."
  },
  {
    "week": 7,
    "ranking": 3,
    "team": "Kansas City Chiefs (5-1)",
    "blurb": "The Chiefs are an undeniable offensive juggernaut. But do they have enough on defense to make a deep playoff run?"
  },
  {
    "week": 7,
    "ranking": 4,
    "team": "New Orleans Saints (4-1)",
    "blurb": "Coming out of a bye, the 4-1 Saints will be tested with back-to-back road games against the Ravens and Vikings."
  },
  {
    "week": 7,
    "ranking": 5,
    "team": "Los Angeles Chargers (4-2)",
    "blurb": "The Chargers have won three straight and Melvin Gordon ran for 132 yards and three touchdowns last week. Two of the best teams in the NFL reside in LA."
  },
  {
    "week": 7,
    "ranking": 6,
    "team": "Pittsburgh Steelers (3-2-1)",
    "blurb": "The Steelers have won two straight and running back Le'Veon Bell might just be coming back this week. It appears Pittsburgh has weathered the storm."
  },
  {
    "week": 7,
    "ranking": 7,
    "team": "Cincinnatti Bengals (4-2)",
    "blurb": "The Bengals are technically first in the loaded AFC North, but that might change after they visit Kansas City this week."
  },
  {
    "week": 7,
    "ranking": 8,
    "team": "Baltimore Ravens (4-2)",
    "blurb": "The Ravens are 4-2 but won't play a team that currently has a losing record until Nov. 25. Good luck!"
  },
  {
    "week": 7,
    "ranking": 9,
    "team": "Miami Dolphins (4-2)",
    "blurb": "Brock Osweiler threw for 380 yards and three touchdowns last weekend, leading the Dolphins to a win over the Bears. I swear, it really happened. I wouldn't lie to you about this."
  },
  {
    "week": 7,
    "ranking": 10,
    "team": "Minnesota Vikings (3-2-1)",
    "blurb": "The Vikings held Arizona to 0-10 on third down last weekend, a week after the Eagles went 2-9 in that department. The Vikings' underperforming defense might be waking up."
  },
  {
    "week": 7,
    "ranking": 11,
    "team": "Washington (3-2)",
    "blurb": "Where would Washington be without Adrian Peterson? The 33-year-old veteran -- who was signed during the preseason -- has rushed for 339 yards and three touchdowns."
  },
  {
    "week": 7,
    "ranking": 12,
    "team": "Chicago Bears (3-2)",
    "blurb": "The Bears had all the momentum in the world coming off a bye week, and they promptly dropped a dud against the Dolphins. Next they get Tom Brady and the Patriots at home."
  },
  {
    "week": 7,
    "ranking": 13,
    "team": "Carolina Panthers (3-2)",
    "blurb": "Carolina committed three turnovers in a relatively unexpected loss at Washington last week. It was an uncharacteristic letdown for the Panthers, who are +2 this season in turnover differential."
  },
  {
    "week": 7,
    "ranking": 14,
    "team": "Philadelphia Eagles (3-3)",
    "blurb": "It's strange to call the defending Super Bowl Champions unproven, but the Eagles' three wins this season have come against the 2-4 Falcons, the 1-5 Colts and the 1-5 Giants."
  },
  {
    "week": 7,
    "ranking": 15,
    "team": "Seattle Seahawks (3-3)",
    "blurb": "The Seahawks enter a bye week on a high, after demolishing the Raiders in London and nearly upsetting the undefeated Rams at home the week before."
  },
  {
    "week": 7,
    "ranking": 16,
    "team": "Green Bay Packers (3-2-1)",
    "blurb": "Aaron Rodgers has thrown for more than 400 yards in each of the last two games, with a total of five touchdowns and zero interceptions. In other words, it's business as usual."
  },
  {
    "week": 7,
    "ranking": 17,
    "team": "Houston Texans (3-3)",
    "blurb": "The good news is that the Texans have won three straight. The bad news is that its star quarterback, Deshaun Watson has injured ribs and has been hit 66 times and sacked 25 times this season."
  },
  {
    "week": 7,
    "ranking": 18,
    "team": "Dallas Cowboys (3-3)",
    "blurb": "The Cowboys hung 40 points on the Jaguars' sturdy defense last weekend, because life is meaningless and the NFL is apparently completely random."
  },
  {
    "week": 7,
    "ranking": 19,
    "team": "New York Jets (3-3)",
    "blurb": "The Jets are probably not very good. They're just better than the three teams they've beaten -- the Lions (2-3), Broncos (2-4) and Colts (1-5)."
  },
  {
    "week": 7,
    "ranking": 20,
    "team": "Jacksonville Jaguars (3-3)",
    "blurb": "In the last two games, the Jaguars' once-dominant defense has given up 70 points, 332 rushing yards and 49 first downs -- and don't expect them to get bailed out by Blake Bortles."
  },
  {
    "week": 7,
    "ranking": 21,
    "team": "Cleveland Browns (2-3-1)",
    "blurb": "Baker Mayfield had the worst game of his young career in a loss to the Chargers last weekend, completing just 47.8 percent of his passes and throwing a pair of interceptions. Let's see how he responds."
  },
  {
    "week": 7,
    "ranking": 22,
    "team": "Tennessee Titans (3-3)",
    "blurb": "Marcus Mariota was sacked 11 times in a 21-0 shutout loss to the Ravens last week. That's not a good way to keep your supposed franchise quarterback healthy."
  },
  {
    "week": 7,
    "ranking": 23,
    "team": "Detroit Lions (2-3)",
    "blurb": "The Lions are a hard team to figure out, with losses against the Jets, 49ers and Cowboys and wins over the Patriots and Packers. They've got winnable games on deck against the Dolphins and Seahawks."
  },
  {
    "week": 7,
    "ranking": 24,
    "team": "Atlanta Falcons (2-4)",
    "blurb": "Matt Ryan hasn't been the problem in the Falcons' 2-4 start. The 33-year-old QB has completed 69.6 percent of his passes, throwing for 14 touchdowns and just two interceptions."
  },
  {
    "week": 7,
    "ranking": 25,
    "team": "Tampa Bay Buccaneers (2-3)",
    "blurb": "The Bucs fired defensive coordinator Mike Smith this week following the team's third consecutive loss. Tampa Bay ranks dead last in scoring defense and 31st in total defense this season."
  },
  {
    "week": 7,
    "ranking": 26,
    "team": "Denver Broncos (2-4)",
    "blurb": "Like the Seahawks, the Broncos nearly beat the Rams last weekend. And like the Seahawks, they ultimately lost at home."
  },
  {
    "week": 7,
    "ranking": 27,
    "team": "Buffalo Bills (2-4)",
    "blurb": "Rookie quarterback Josh Allen was knocked out of last week's game against the Texans with an injury, which forced Nathan Peterman into the game. That's never good news for Buffalo."
  },
  {
    "week": 7,
    "ranking": 28,
    "team": "Indianapolis Colts (1-5)",
    "blurb": "The Colts have allowed an average of 39 points in their last three games and are 0-3 during that stretch. The loser of Sunday's game against the Bills should probably be exiled from the NFL."
  },
  {
    "week": 7,
    "ranking": 29,
    "team": "New York Giants (1-5)",
    "blurb": "Saquon Barkley gained 229 total yards last week and the Giants still lost by three touchdowns. That's got to be a helpless feeling."
  },
  {
    "week": 7,
    "ranking": 30,
    "team": "Arizona Cardinals (1-5)",
    "blurb": "A primary storyline for the Cardinals has to be the ineffectiveness of running back David Johnson, who has yet to rush for more than 71 yards in a game."
  },
  {
    "week": 7,
    "ranking": 31,
    "team": "San Francisco 49ers (1-5)",
    "blurb": "San Francisco had every opportunity to upset the Packers on Monday Night Football. But somehow, in a QB duel between Aaron Rodgers and C.J. Beathard, Rodgers won."
  },
  {
    "week": 7,
    "ranking": 32,
    "team": "Oakland Raiders (1-5)",
    "blurb": "The Raiders have scored just 13 points in their last two games and basically no-showed in London last week. Jon Gruden might hope this bye week never ends."
  }
]